###################################################################

# Created by write_sdc on Fri Nov 27 20:47:13 2015

###################################################################
set sdc_version 1.9

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_wire_load_mode enclosed
set_driving_cell -lib_cell buffd1 [get_ports rst_n]
set_driving_cell -lib_cell buffd1 [get_ports REG_WR]
set_driving_cell -lib_cell buffd1 [get_ports {IDAT[7]}]
set_driving_cell -lib_cell buffd1 [get_ports {IDAT[6]}]
set_driving_cell -lib_cell buffd1 [get_ports {IDAT[5]}]
set_driving_cell -lib_cell buffd1 [get_ports {IDAT[4]}]
set_driving_cell -lib_cell buffd1 [get_ports {IDAT[3]}]
set_driving_cell -lib_cell buffd1 [get_ports {IDAT[2]}]
set_driving_cell -lib_cell buffd1 [get_ports {IDAT[1]}]
set_driving_cell -lib_cell buffd1 [get_ports {IDAT[0]}]
set_driving_cell -lib_cell buffd1 [get_ports {addr[2]}]
set_driving_cell -lib_cell buffd1 [get_ports {addr[1]}]
set_driving_cell -lib_cell buffd1 [get_ports {addr[0]}]
set_driving_cell -lib_cell buffd1 [get_ports sw1]
set_driving_cell -lib_cell buffd1 [get_ports sw2]
set_driving_cell -lib_cell buffd1 [get_ports sw3]
set_driving_cell -lib_cell buffd1 [get_ports sw4]
set_driving_cell -lib_cell buffd1 [get_ports sda]
set_load -pin_load 2 [get_ports scl]
set_load -pin_load 2 [get_ports sda]
set_load -pin_load 2 [get_ports {ackflag[2]}]
set_load -pin_load 2 [get_ports {ackflag[1]}]
set_load -pin_load 2 [get_ports {ackflag[0]}]
set_load -pin_load 2 [get_ports {outdata[7]}]
set_load -pin_load 2 [get_ports {outdata[6]}]
set_load -pin_load 2 [get_ports {outdata[5]}]
set_load -pin_load 2 [get_ports {outdata[4]}]
set_load -pin_load 2 [get_ports {outdata[3]}]
set_load -pin_load 2 [get_ports {outdata[2]}]
set_load -pin_load 2 [get_ports {outdata[1]}]
set_load -pin_load 2 [get_ports {outdata[0]}]
create_clock [get_ports clk]  -period 100  -waveform {0 50}
set_clock_uncertainty 0.35  [get_clocks clk]
set_input_delay -clock clk  -max 2  [get_ports rst_n]
set_input_delay -clock clk  -max 2  [get_ports REG_WR]
set_input_delay -clock clk  -max 2  [get_ports {IDAT[7]}]
set_input_delay -clock clk  -max 2  [get_ports {IDAT[6]}]
set_input_delay -clock clk  -max 2  [get_ports {IDAT[5]}]
set_input_delay -clock clk  -max 2  [get_ports {IDAT[4]}]
set_input_delay -clock clk  -max 2  [get_ports {IDAT[3]}]
set_input_delay -clock clk  -max 2  [get_ports {IDAT[2]}]
set_input_delay -clock clk  -max 2  [get_ports {IDAT[1]}]
set_input_delay -clock clk  -max 2  [get_ports {IDAT[0]}]
set_input_delay -clock clk  -max 2  [get_ports {addr[2]}]
set_input_delay -clock clk  -max 2  [get_ports {addr[1]}]
set_input_delay -clock clk  -max 2  [get_ports {addr[0]}]
set_input_delay -clock clk  -max 2  [get_ports sw1]
set_input_delay -clock clk  -max 2  [get_ports sw2]
set_input_delay -clock clk  -max 2  [get_ports sw3]
set_input_delay -clock clk  -max 2  [get_ports sw4]
set_input_delay -clock clk  -max 2  [get_ports sda]
set_output_delay -clock clk  -max 2  [get_ports sda]
set_output_delay -clock clk  -max 2  [get_ports scl]
set_output_delay -clock clk  -max 2  [get_ports {ackflag[2]}]
set_output_delay -clock clk  -max 2  [get_ports {ackflag[1]}]
set_output_delay -clock clk  -max 2  [get_ports {ackflag[0]}]
set_output_delay -clock clk  -max 2  [get_ports {outdata[7]}]
set_output_delay -clock clk  -max 2  [get_ports {outdata[6]}]
set_output_delay -clock clk  -max 2  [get_ports {outdata[5]}]
set_output_delay -clock clk  -max 2  [get_ports {outdata[4]}]
set_output_delay -clock clk  -max 2  [get_ports {outdata[3]}]
set_output_delay -clock clk  -max 2  [get_ports {outdata[2]}]
set_output_delay -clock clk  -max 2  [get_ports {outdata[1]}]
set_output_delay -clock clk  -max 2  [get_ports {outdata[0]}]
